In [1]:
import pandas as pd
import polars as pl

In [2]:
data_list = [[1,"Alice"], [2,"Bob"], [3,"TIm"]]

In [3]:
pd.DataFrame(data_list,columns=["ID","Name"])

   ID   Name
0   1  Alice
1   2    Bob
2   3    TIm

In [4]:
pl.DataFrame(data_list,schema=["ID","Name"],orient="row")

shape: (3, 2)
┌─────┬───────┐
│ ID  ┆ Name  │
│ --- ┆ ---   │
│ i64 ┆ str   │
╞═════╪═══════╡
│ 1   ┆ Alice │
│ 2   ┆ Bob   │
│ 3   ┆ TIm   │
└─────┴───────┘

In [5]:
grades = pd.DataFrame({
    "Name": ['Amith', 'Bob', 'Charlie', 'Delta', 'Egg'],
    "Grade": [85, 20, 78, 92, 88]
})
grades["Passed"] = grades["Grade"] > 35

In [6]:
grades

      Name  Grade  Passed
0    Amith     85    True
1      Bob     20   False
2  Charlie     78    True
3    Delta     92    True
4      Egg     88    True

In [7]:
grades.describe()

           Grade
count   5.000000
mean   72.600000
std    29.846273
min    20.000000
25%    78.000000
50%    85.000000
75%    88.000000
max    92.000000

In [8]:
grades.sort_values(by='Grade')

      Name  Grade  Passed
1      Bob     20   False
2  Charlie     78    True
0    Amith     85    True
4      Egg     88    True
3    Delta     92    True

Lab 1

In [9]:
temperature = pd.Series([76,66,85,77,72],index=['Mon',"Tue","Wed","Thurs","Fri",])
temperature['Wed']

85

LAB 2
1. Create a DataFrame named inventory with columns: Item, Quantity, and Price, containing at least 4 different items
with random quantities and prices
2. Print the DataFrame and then calculate the total value of each item (Quantity * Price) and add it as a new column
called TotalValue

In [20]:
inventory = pd.DataFrame({"Item":["Book","Pen","Scale","Eraser"],"Quantity":[15,44,3,13],"Price":[10,5,4,5]})
inventory

     Item  Quantity  Price
0    Book        15     10
1     Pen        44      5
2   Scale         3      4
3  Eraser        13      5

In [21]:
inventory["TotalValue"] = inventory["Quantity"]*inventory["Price"]

In [22]:
inventory

     Item  Quantity  Price  TotalValue
0    Book        15     10         150
1     Pen        44      5         220
2   Scale         3      4          12
3  Eraser        13      5          65

LAB3
1. Using the Inventory DataFrame filter and print all items with a Quantity greater than 10
2. Sort the DataFrame by Price in Ascending Order

In [23]:
inventory[inventory["Quantity"]>10]

     Item  Quantity  Price  TotalValue
0    Book        15     10         150
1     Pen        44      5         220
3  Eraser        13      5          65

In [27]:
inventory.sort_values(by="Price",ascending=True)

     Item  Quantity  Price  TotalValue
2   Scale         3      4          12
1     Pen        44      5         220
3  Eraser        13      5          65
0    Book        15     10         150

LAB4
1. Use the inventory DataFrame to get summary statistics on Quantity and Price Hint: inventory[['Quantity','Price']]
2. Find the iTem with the highest TotalValue Hint:use max() method on totalvalue column

In [29]:
inventory[['Quantity','Price']].describe()

        Quantity      Price
count   4.000000   4.000000
mean   18.750000   6.000000
std    17.632829   2.708013
min     3.000000   4.000000
25%    10.500000   4.750000
50%    14.000000   5.000000
75%    22.250000   6.250000
max    44.000000  10.000000

In [ ]:
inventory[inventory['TotalValue'] == inventory['TotalValue'].max()]

  Item  Quantity  Price  TotalValue
1  Pen        44      5         220

In [36]:
csv_file = pd.read_csv("dummy.csv")
csv_file

  Month  Product ID  Sales  Revenue
0   Jan         101    196     3561
1   Jan         132    124     4567
2   Feb         102    264     6231
3   Feb         110    188     5467
4   Mar         101    323     3124

In [40]:
csv_file.head(3)
csv_file.tail(3)

  Month  Product ID  Sales  Revenue
2   Feb         102    264     6231
3   Feb         110    188     5467
4   Mar         101    323     3124

In [44]:
csv_file.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Month       5 non-null      object
 1   Product ID  5 non-null      int64
 2   Sales       5 non-null      int64
 3   Revenue     5 non-null      int64
dtypes: int64(3), object(1)
memory usage: 292.0+ bytes

LAB
1. Define a list of students, each with their scores in Math, Science and English
2. Store the data in dictionary format
3. write a function to calculate the total score for each student
4. write another function to calculate the average score for each student
5. Convert the dictinary into a pandas dataframe
6. add a new columns to the dataframe for a. total score of each student, b. average score for each student, c. status
that shows if the student passed or failed
7. Filter and display students who passed and those who failed
8. Display the complete DataFrame with grades

In [90]:
name_list = ["Alice","Bob","Tim"]
math_list = [80,76,99]
sci_list = [77,66,85]
eng_list = [54,98,100]
student_dict = {"Name":name_list ,"Maths":math_list,"Science":sci_list ,"English": eng_list}

for data in zip(name_list,math_list,sci_list,eng_list):
    print(f"{data[0]}: {sum(data[1:])}")

Alice: 211
Bob: 240
Tim: 284

In [91]:
def get_sum(student_data):
    print(f"{sum(student_data[1:])}",end="\t")
    
def get_avg(student_data):
    print(f"{sum(student_data[1:])/3}",)
    
print("Name","Total","Average",sep='\t')
for data in zip(name_list,math_list,sci_list,eng_list):
    print(data[0],end="\t")
    get_sum(data)
    get_avg(data)

Name	Total	Average
Alice	211	70.33333333333333
Bob	240	80.0
Tim	284	94.66666666666667

In [92]:
student_data = pd.DataFrame(student_dict)
student_data

    Name  Maths  Science  English
0  Alice     80       77       54
1    Bob     76       66       98
2    Tim     99       85      100

In [93]:
student_data["Total"] = student_data["Maths"] + student_data["Science"] + student_data["English"]
student_data

    Name  Maths  Science  English  Total
0  Alice     80       77       54    211
1    Bob     76       66       98    240
2    Tim     99       85      100    284

In [94]:
student_data["Average"] = (student_data["Maths"] + student_data["Science"] + student_data["English"]) / 3
student_data

    Name  Maths  Science  English  Total    Average
0  Alice     80       77       54    211  70.333333
1    Bob     76       66       98    240  80.000000
2    Tim     99       85      100    284  94.666667

In [95]:
student_data["Status"] = (student_data["Maths"] > 60) & (student_data["Science"] > 60) & (student_data["English"] > 60)
# student_data["Status"] = all(zip(student_data["Maths"], student_data["Science"], student_data["English"])) > 60

In [96]:
student_data

    Name  Maths  Science  English  Total    Average  Status
0  Alice     80       77       54    211  70.333333   False
1    Bob     76       66       98    240  80.000000    True
2    Tim     99       85      100    284  94.666667    True

In [97]:
print("Pass")
print(student_data[student_data["Status"]==True])
print("Fail")
print(student_data[student_data["Status"]==False])

Pass
  Name  Maths  Science  English  Total    Average  Status
1  Bob     76       66       98    240  80.000000    True
2  Tim     99       85      100    284  94.666667    True
Fail
    Name  Maths  Science  English  Total    Average  Status
0  Alice     80       77       54    211  70.333333   False

In [99]:
def assign_grade(avg):
    if avg >= 90:
        return "A"
    elif avg >= 80:
        return "B"
    elif avg >= 70:
        return "C"
    elif avg >= 60:
        return "D"
    else:
        return "F"
    
student_data["Grade"] = student_data["Average"].apply(assign_grade)

In [100]:
student_data

    Name  Maths  Science  English  Total    Average  Status Grade
0  Alice     80       77       54    211  70.333333   False     C
1    Bob     76       66       98    240  80.000000    True     B
2    Tim     99       85      100    284  94.666667    True     A